app/controllers/houses_controller.rb

  def create
    @house = House.new(house_params)
    if @house.save
---
INSERT INTO "houses" ("name", "author", "source", "motto") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Carty"], ["author", "Nick Carty"], ["source", "Boston"], ["motto", ""]]