app/controllers/members_controller.rb

  def create
    @house = House.find(params[:house_id])
    @member = Member.new(member_params)
    @member.house = @house
    @members = @house.members

    if @member.save
---
INSERT INTO "members" ("first_name", "last_name", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Dave"], ["last_name", "Carty"], ["house_id", 1], ["created_at", "2018-10-11 22:25:08.478482"], ["updated_at", "2018-10-11 22:25:08.478482"]]